{
  "career": [
    {
      "name": "Magic Hour (YC W24)",
      "href": "https://www.magichour.ai/",
      "logo": "/img/magichour.png",
      "positions": [
        {
          "title": "Software Engineer Intern",
          "start": "Nov 2025",
          "description": [
            "Cut AI video generation time by 49% using torch.compile, FlashAttention, and other optimizations (SageAttn2, FP16Fast, TeaCache).",
            "Built a TikTok scraper that bypasses SSL pinning with a custom MITM proxy to collect high-engagement videos for training data.",
            "Ran 500+ controlled test renders to identify the best settings and published results on an internal website."
          ]
        }
      ]
    },
    {
      "name": "Cluely",
      "href": "https://cluely.com/",
      "logo": "/img/cluely.png",
      "positions": [
        {
          "title": "Machine Learning Engineer (Contract)",
          "start": "Sep 2025",
          "end": "Oct 2025",
          "description": [
            "Built a real-time gaze tracking system that runs entirely on CPU. Tracks head pose and eye position at 15-30 FPS with 100ms latency.",
            "Used webcam + landmark detection with temporal smoothing to classify gaze direction. Outputs both a debug overlay and NDJSON stream for analytics."
          ]
        }
      ]
    },
    {
      "name": "Smashspeed",
      "href": "https://smashspeed.ca/",
      "logo": "/img/smashspeed.png",
      "positions": [
        {
          "title": "Chief Technology Officer",
          "start": "May 2025",
          "description": [
            "Developed Smashspeed, an AI badminton tracker that detects shots and estimates smash speed in real-time. Hit 40k+ downloads across 100+ countries.",
            "Ported the ML shuttle tracker to React Native and built a scalable Firebase backend (Auth, Firestore, Cloud Functions, Cloud Storage).",
            "Trained a YOLOv5 model to detect shuttlecocks—annotated 13k+ images to reach 93% accuracy."
          ]
        }
      ]
    },
    {
      "name": "FTC Robotics - Furious Frogs",
      "href": "https://furious-frogs-website.vercel.app/",
      "logo": "/img/furiousfrogs.png",
      "positions": [
        {
          "title": "Developer",
          "start": "Sep 2024",
          "description": [
            "Built the vision system for our robotics team. We ranked #191 out of 100,000 teams worldwide in the 2024 season.",
            "Implemented auto-aim using AprilTags and OpenCV. Tuned PID controllers until the targeting was fast and stable enough for competition."
          ]
        }
      ]
    }
  ]
}